# read design
read_verilog fifo.v

# module hierarchy
hierarchy -check -top fifo

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to mycells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

# write synsthesized design
write_verilog fifo_sint.v